tap "browsh-org/browsh"
tap "krishkrosh/apps"
brew "libtiff"
brew "protobuf"
brew "apache-arrow"
brew "arp-scan"
brew "clang-format"
brew "cmake"
brew "cocoapods"
brew "daktilo"
brew "eigen"
brew "fribidi"
brew "icu4c@77"
brew "harfbuzz"
brew "ffmpeg"
brew "fortls"
brew "mpfr"
brew "gcc"
brew "ghostscript"
brew "git"
brew "gnuplot"
brew "pkgconf"
brew "hdf5"
brew "libusbmuxd"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "libomp"
brew "imagemagick"
brew "juliaup"
brew "lapack"
brew "mas"
brew "neovim"
brew "ninja"
brew "node"
brew "numpy"
brew "open-mpi"
brew "poppler"
brew "pdfpc"
brew "python-matplotlib"
brew "r"
brew "ripgrep"
brew "tex-fmt"
brew "texlive"
brew "trash", link: true
brew "tree"
brew "uv"
brew "wget"
brew "zlib"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "audacity"
cask "blackhole-2ch"
cask "brave-browser"
cask "chatgpt"
cask "cisdem-data-recovery"
cask "coconutbattery"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "freedom"
cask "garmin-express"
cask "google-drive"
cask "grammarly-desktop"
cask "imazing"
cask "inkscape"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "lm-studio"
cask "microsoft-auto-update"
cask "microsoft-onenote"
cask "microsoft-teams"
cask "miniforge"
cask "nomachine"
cask "opera"
cask "r-app"
cask "raycast"
cask "rstudio"
cask "rustdesk"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "steam"
cask "surfshark"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "xquartz"
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MyWallpaper", id: 1552826194
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenNote", id: 1258500140
mas "System Watcher", id: 1269106895
mas "VirusBarrier Scanner", id: 1200445649
