tap "browsh-org/browsh"
brew "libtiff"
brew "protobuf"
brew "llvm"
brew "apache-arrow"
brew "arp-scan"
brew "cmake"
brew "cocoapods"
brew "daktilo"
brew "eigen"
brew "fribidi"
brew "icu4c@77"
brew "harfbuzz"
brew "ffmpeg"
brew "fortls"
brew "mpfr"
brew "gcc"
brew "ghostscript"
brew "git"
brew "gnuplot"
brew "pkgconf"
brew "hdf5"
brew "libomp"
brew "imagemagick"
brew "juliaup"
brew "lapack"
brew "mas"
brew "ninja"
brew "open-mpi"
brew "poppler"
brew "r"
brew "texlive"
brew "trash", link: true
brew "tree"
brew "uv"
brew "wget"
brew "zlib"
cask "android-studio"
cask "appcleaner"
cask "blender"
cask "chatgpt"
cask "cisdem-data-recovery"
cask "coconutbattery"
cask "discord"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "inkscape"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "macs-fan-control"
cask "microsoft-auto-update"
cask "microsoft-onenote"
cask "microsoft-teams"
cask "onyx"
cask "opera"
cask "r"
cask "raycast"
cask "rstudio"
cask "scroll-reverser"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "warp"
cask "xquartz"
cask "zoom"
cask "zotero"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Goodnotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MyWallpaper", id: 1552826194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenNote", id: 1258500140
mas "System Watcher", id: 1269106895
mas "VirusBarrier Scanner", id: 1200445649
mas "Xcode", id: 497799835
