tap "browsh-org/browsh"
brew "libtiff"
brew "protobuf"
brew "llvm"
brew "apache-arrow"
brew "arp-scan"
brew "cmake"
brew "cocoapods"
brew "daktilo"
brew "eigen"
brew "fribidi"
brew "icu4c@77"
brew "harfbuzz"
brew "python@3.12"
brew "ffmpeg"
brew "fortls"
brew "mpfr"
brew "gcc"
brew "ghostscript"
brew "git"
brew "gnuplot"
brew "pkgconf"
brew "hdf5"
brew "libomp"
brew "imagemagick"
brew "juliaup"
brew "lapack"
brew "mas"
brew "ninja"
brew "numpy"
brew "open-mpi"
brew "poppler"
brew "python-matplotlib"
brew "r"
brew "texlive"
brew "trash", link: true
brew "tree"
brew "uv"
brew "wget"
brew "zlib"
cask "android-studio"
cask "appcleaner"
cask "blender"
cask "chatgpt"
cask "cisdem-data-recovery"
cask "coconutbattery"
cask "discord"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "inkscape"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "macs-fan-control"
cask "microsoft-auto-update"
cask "microsoft-onenote"
cask "microsoft-teams"
cask "onyx"
cask "opera"
cask "r"
cask "raycast"
cask "rstudio"
cask "scroll-reverser"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "warp"
cask "xquartz"
cask "zoom"
cask "zotero"
vscode "0h7z.vscode-julia-format"
vscode "almenon.arepl"
vscode "batisteo.vscode-django"
vscode "bierner.gif-player"
vscode "cameronbieganek.julia-color-themes"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "fortran-lang.linter-gfortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "google.geminicodeassist"
vscode "h5web.vscode-h5web"
vscode "iamhyc.overleaf-workshop"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jock.svg"
vscode "julialang.language-julia"
vscode "kevinrose.vsc-python-indent"
vscode "mkvoya.eps-preview"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "percy.vscode-numpy-viewer"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "znck.grammarly"
